Revit 2020 API
UnitUtils.ConvertToInternalUnits Method
 Converts a value from a given display unit to Revit's internal units.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2014
Syntax
C#
public static double ConvertToInternalUnits(
	double value,
	DisplayUnitType displayUnit
)
Visual Basic
Public Shared Function ConvertToInternalUnits ( _
	value As Double, _
	displayUnit As DisplayUnitType _
) As Double
Visual C++
public:
static double ConvertToInternalUnits(
	double value,
	DisplayUnitType displayUnit
)
Parameters
value
Type: System.Double
 The value to convert.
displayUnit
Type: Autodesk.Revit.DB.DisplayUnitType
 The value's display unit.
Return Value
 The converted value.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The given value for value is not finite -or- displayUnit is an invalid display unit. See UnitUtils.IsValidDisplayUnit(DisplayUnitType) and UnitUtils.GetValidDisplayUnits().
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
UnitUtils Class
Autodesk.Revit.DB Namespace